Autodesk.Revit.DB.Structure.MorphedDistributionRebarHandles
This enum represents the values that custom handles tags of RebarConstrainedHandle of Rebar Free Form Morphed Distribution have.
The tag of a Autodesk::Revit::DB::Structure::RebarHandleType::CustomHandle RebarConstrainedHandle
can be obtained by calling the Autodesk::Revit::DB::Structure::RebarConstrainedHandle::GetCustomHandleTag()
Since:
2027
Since:
2027

Autodesk.Revit.DB.Structure.MorphedDistributionRebarHandles.EndOfSet
Tag for handle that that defines where the set ends. This handle accepts only constraints of Autodesk::Revit::DB::Structure::RebarConstraintType::ToCustomTarget type.

Autodesk.Revit.DB.Structure.MorphedDistributionRebarHandles.StartOfSet
Tag for handle that that defines where the set starts. This handle accepts only constraints of Autodesk::Revit::DB::Structure::RebarConstraintType::ToCustomTarget type.

Autodesk.Revit.DB.Structure.MorphedDistributionRebarHandles.Definition
Tag for handle that has constraints to target rebar's edges. This handle accepts constraints only to other rebar edges.